package kr.co.organize;

public class Ex3_For_While {
	
	/*
	  
		< 반복문 >
		
		[for]
		- 반복 횟수를 알고 있을 때 사용
		- 초기식 : int i = 0;
		- 조건식 : i < 10;
		- 증감식 : i++
		
			for(초기식; 조건식; 증감식) {
				반복 실행할 코드
			}
			
		[중첩 for]	
		- for문 안에 for문이 더 있는 구조
		- 처음 for문이 한번 돌 때, 안에 있는 for문이 조건에 충족할 때 까지 반복 -> 처음 for문 2번째 조건 ...
		
			for(초기식; 조건식; 증감식) {
				반복 실행할 코드
				for(초기식; 조건식; 증감식) {
				반복 실행할 코드
				}
				반복 실행할 코드
			}
		
		[for-each]	
		- 배열에 있는 값을 하나씩 출력하는 문법 
		- 출력할 요소가 없으면 문법 종료
		- 출력할 변수와 배열의 자료형을 동일해야함
		
			for(자료형 변수명 : 배열명) {
				실행할 코드
			}
		
		[while]
		- 반복할 횟수를 모를 경우 사용
		- 무한 루프가 발생할 수 있으니 사용시 주의가 필요함 (CPU 성능 많이 사용)
			
			while(조건식){
				실행할 코드
			}
		
		[do-while]
		- 반복하기 전, 한번 꼭 실행해야하는 로직이 있을 경우 사용
		
			do {
				실행할 코드
			} while(조건식) {
				실행할 코드
			}
		
	*/
	
}
